Revit 2024 API
CurveArrArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Insert(
	CurveArray item,
	int index
)
Visual Basic
Public Overridable Sub Insert ( _
	item As CurveArray, _
	index As Integer _
)
Visual C++
public:
virtual void Insert(
	CurveArray^ item,
	int index
)
Parameters
item
Type: Autodesk.Revit.DB.CurveArray
index
Type: System.Int32
See Also
CurveArrArray Class
Autodesk.Revit.DB Namespace